Revit 2027 API
ExternalDataManagerCommand.Executable Property
 Indicates if the command is executable.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Executable { get; set; }
Public Property Executable As Boolean
	Get
	Set
public:
property bool Executable {
	bool get ();
	void set (bool value);
}
member Executable : bool with get, set
Property Value
Boolean
Remarks
 The default value is true.
See Also
Reference
ExternalDataManagerCommand Class
Autodesk.Revit.UI Namespace